Documents/ВедомостьНаПеречислениеПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаПеречислениеПрочихВыплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСуммКПеречислению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиГлавногоБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияРегистрацийВНалоговомОрганеВторичный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВНалоговомОрганеВторичный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ГруппыНачисленияУдержанияВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ГруппыНачисленияУдержанияВыплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начислено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоБухучету</Name>
					<Comment> Возвращает выплаты в течение календарного месяца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоМесяцамРасчета</Name>
					<Comment>Возвращает выплаты за расчетные месяцы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПлатежногоПоручения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежногоПоручения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихВыплат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КлассификаторБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторБанков</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондентский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеятельностьПрекращена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СВИФТБИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКРКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодЦБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВедомостьНаПеречислениеПрочихВыплат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ПрочиеВыплаты.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти   

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Список на перечисление прочих выплат
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СписокНаПеречислениеПрочихВыплат";
	КомандаПечати.Представление = НСтр("ru = 'Список на перечисление профессиональных выплат за счёт средств работодателя'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы 
//                                            (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение      - ссылка на объект;
//                                            представление - имя области в которой был выведен объект
//                                            (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                            (выходной параметр);
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписокНаПеречислениеПрочихВыплат") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СписокНаПеречислениеПрочихВыплат",
			НСтр("ru = 'Список на перечисление профессиональных выплат за счёт средств работодателя'"),
			ПечатьСпискаПеречисленийПоДокументам(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ВедомостьНаПеречислениеПрочихВыплат.ПФ_MXL_СписокПеречисленияПрочихВыплат");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ВедомостьНаПеречислениеПрочихВыплат;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция ПодготовитьПараметрыПроведения(Объект, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;

	ДанныеПрочихВыплат = ДанныеПрочихВыплат(Объект);
	
	ПараметрыПроведения.Вставить("ДанныеПрочихВыплат", ДанныеПрочихВыплат);
	
	Возврат ПараметрыПроведения;

КонецФункции

Функция РеквизитыОтветственныхЛиц() Экспорт
	
	РеквизитыОтветственныхЛиц = Новый Массив;
	
	РеквизитыОтветственныхЛиц.Добавить("ГлавныйБухгалтер");
	РеквизитыОтветственныхЛиц.Добавить("ДолжностьГлавногоБухгалтера");
	
	Возврат РеквизитыОтветственныхЛиц
	
КонецФункции	

#КонецОбласти   

#Область ОбработчикиСобытий

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПрочихВыплат(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаПлатежа, ДЕНЬ) КАК Период
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|	Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ДанныеДокумента
			|ГДЕ
			|	ДанныеДокумента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СУММА(ДанныеПрочиеВыплаты.Сумма) КАК СуммаВзаиморасчетов,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено) КАК ВидСтроки
			|ПОМЕСТИТЬ ВТ_ДанныеПрочиеВыплаты
			|ИЗ
			|	Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|ГДЕ
			|	ДанныеПрочиеВыплаты.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДокумента.Период КАК Период,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	ДанныеПрочиеВыплаты.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|	ЕСТЬNULL(ИсторияРегистрацийВНалоговомОрганеПодразделения.РегистрацияВНалоговомОргане, ИсторияРегистрацийВНалоговомОрганеОрганизация.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
			|ИЗ
			|	ВТ_ДанныеПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ДанныеДокумента
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеОрганизация
			|		ПО (ДанныеДокумента.Организация = ИсторияРегистрацийВНалоговомОрганеОрганизация.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаОкончания)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеПодразделения
			|		ПО (ДанныеДокумента.Подразделение = ИсторияРегистрацийВНалоговомОрганеПодразделения.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаОкончания)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатьСпискаПеречисленийПоДокументам(МассивОбъектов, ОбъектыПечати, ПлатежныйДокумент = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокПеречислениеПрочихВыплатКПлатежномуПоручению";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьНаПеречислениеПрочихВыплат.ПФ_MXL_СписокПеречисленияПрочихВыплат");
	
	// получим данные для печати
	ВыборкаПоРегистратору = СформироватьЗапросДляПечатиПрочиеВыплаты("ПоРеквизитам", МассивОбъектов).Выбрать();
	ВыборкаПоДокументам   = СформироватьЗапросДляПечатиПрочиеВыплаты("ПоТабличнойЧасти", МассивОбъектов).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ВыборкаПоРегистратору.Следующий() Цикл
		
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапки   			= Макет.ПолучитьОбласть("Шапка");
		
		ОбластьПодвалаИтог		= Макет.ПолучитьОбласть("Подвал|Итог");
		
		ОбластьПодвала = Макет.ПолучитьОбласть("Подвал|Подписи_ИИН");
		
		ОбластьШапкиТаблицы  	= Макет.ПолучитьОбласть("ШапкаТаблицы_ИИН");
		ОбластьСтроки  			= Макет.ПолучитьОбласть("СтрокаРаботника_ИИН");
		
		// массив с двумя строками - для разбиения на страницы
	    ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьСтроки);

		ОбластьШапки.Параметры.Заполнить(ВыборкаПоРегистратору);
		
		ОбластьШапки.Параметры.НомерДокумента  = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоРегистратору.НомерДокумента);
		ОбластьШапки.Параметры.ДатаДокумента   = Формат(ВыборкаПоРегистратору.ДатаДокумента, "ДФ='дд ММММ гггг'") + " г.";

		ОбластьШапки.Параметры.НазваниеОрганизации = СокрЛП(ВыборкаПоРегистратору.НазваниеОрганизации);
		ОбластьШапки.Параметры.БИНОрганизации  = ВыборкаПоРегистратору.БИНОрганизации;
		
		Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
			ПеречислениеПрочихВыплат = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат");
		Иначе
			Модуль = ОбщегоНазначения.ОбщийМодуль("УчетПрочихВыплатУП");
			ПеречислениеПрочихВыплат = Модуль.ПеречислениеПрочихВыплатЗначение();
		КонецЕсли;

		Если ВыборкаПоРегистратору.ВидОперации = ПеречислениеПрочихВыплат Тогда
			
			ОбластьШапки.Параметры.Наименование  = НСтр("ru = 'Список на перечисление профессиональной выплаты за счет средств работодателя'");

			ОбластьШапки.Параметры.БИНГЦВП  = ВыборкаПоРегистратору.БИНГЦВП;
			
		КонецЕсли;	
		
		ТабДокумент.Вывести(ОбластьШапки);
		ТабДокумент.Вывести(ОбластьШапкиТаблицы);
		
		// подсчитываем количество строк документа - для корректного разбиения на страницы
		ВыборкаПоДокументам.Сбросить();
		
		Если ВыборкаПоДокументам.НайтиСледующий(ВыборкаПоРегистратору.Ссылка) Тогда
			ВыборкаПоФизЛицам = ВыборкаПоДокументам.Выбрать();
		Иначе
			ВыборкаПоФизЛицам = Неопределено;
		КонецЕсли;
		
		НомерСтроки = 1; 
		
		Если НЕ ВыборкаПоФизЛицам = Неопределено Тогда
				
			ВсегоСтрокДокумента = ВыборкаПоФизЛицам.Количество();
			
			Пока ВыборкаПоФизЛицам.Следующий() Цикл
				Если ВыборкаПоФизЛицам.Сумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьСтроки.Параметры.Заполнить(ВыборкаПоФизЛицам);
				ОбластьСтроки.Параметры.НомерСтроки  	= НомерСтроки;
				ОбластьСтроки.Параметры.ПериодПлатежа 	= ВыборкаПоФизЛицам.ПериодРегистрации;
				ОбластьСтроки.Параметры.ИИН				= ВыборкаПоФизЛицам.ИИН;
				ОбластьСтроки.Параметры.Сумма 			= ВыборкаПоФизЛицам.Сумма;
								
				// Проверим, уместится ли строка на странице или надо открывать новую страницу
				ВывестиПодвалЛиста = НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти);
				
				Если НЕ ВывестиПодвалЛиста И НомерСтроки = ВсегоСтрокДокумента Тогда
					ВыводимыеОбласти.Добавить(ОбластьПодвала);
					ВывестиПодвалЛиста = НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти);
				КонецЕсли;
				Если ВывестиПодвалЛиста Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьШапки);
					
					ТабДокумент.Вывести(ОбластьШапкиТаблицы);			
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьСтроки);
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
				
		КонецЕсли;
		
		// подвал
		ОбластьПодвалаИтог.Параметры.СуммаИтого	 = Формат(ВыборкаПоДокументам.Сумма, "ЧЦ=10; ЧДЦ=2; ЧРД=,");
		ОбластьПодвала.Параметры.КоличествоСтрок = ВсегоСтрокДокумента;
		ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
		ОбластьПодвала.Параметры.СуммаПрописью   = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаПоДокументам.Сумма, ВалютаУчета);
		
		ОтветственныеЛица = ЗарплатаКадры.ОтветственныеЛицаОрганизации(ВыборкаПоРегистратору.Организация, "Руководитель,ГлавныйБухгалтер", ВыборкаПоРегистратору.ДатаСведений);
		ОбластьПодвала.Параметры.Руководитель = ОтветственныеЛица.Руководитель;
		ОбластьПодвала.Параметры.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ВыборкаПоРегистратору.ГлавныйБухгалтер),  ВыборкаПоРегистратору.ГлавныйБухгалтер, ОтветственныеЛица.ГлавныйБухгалтер);

		ТабДокумент.Вывести(ОбластьПодвала);
	    ТабДокумент.Присоединить(ОбластьПодвалаИтог);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоРегистратору.Ссылка);
		
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьЗапросДляПечатиПрочиеВыплаты(Режим, МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("МассивОбъектов", МассивСсылок);
	Запрос.УстановитьПараметр("ВидПрочихВыплат", Справочники.ВидыПрочихВыплат.ПрофессиональнаяВыплатаЗаСчетРаботодателя);

	МассивВидовОпераций = Новый Массив;
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		ПеречислениеПрочихВыплат = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат");
	Иначе
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетПрочихВыплатУП");
		ПеречислениеПрочихВыплат = Модуль.ПеречислениеПрочихВыплатЗначение();
	КонецЕсли;
	
	МассивВидовОпераций.Добавить(ПеречислениеПрочихВыплат);
	
	Запрос.УстановитьПараметр("ПеречислениеПрочихВыплат", ПеречислениеПрочихВыплат);
	Запрос.УстановитьПараметр("МассивВидовОпераций", МассивВидовОпераций);
		
	Если Режим = "ПоРеквизитам" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЕСТЬNULL(ПлатежноеПоручениеПрочие.Ссылка, ЗНАЧЕНИЕ(Документ.ПлатежноеПоручение.ПустаяСсылка)) КАК ПлатежноеПоручениеСсылка,
		|	ПеречислениеПрочихВыплат.Ссылка КАК Ссылка,
		|	ПеречислениеПрочихВыплат.ВидПрочихВыплат КАК ВидПрочихВыплат,
		|	ПеречислениеПрочихВыплат.Организация КАК Организация,
		|	ПеречислениеПрочихВыплат.Дата КАК Дата,
		|	ПеречислениеПрочихВыплат.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ПеречислениеПрочихВыплат.Контрагент КАК Контрагент,
		|	МИНИМУМ(ПеречислениеПрочихВыплат.ПериодВзаиморасчетов) КАК ПериодПлатежа
		|ПОМЕСТИТЬ ВТ_ВедомостьНаПеречислениеПрочихВыплат
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ПеречислениеПрочихВыплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеПрочие
		|		ПО ПеречислениеПрочихВыплат.Ссылка = ПлатежноеПоручениеПрочие.Ведомость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручение.Ссылка = ПлатежноеПоручениеПрочие.Ссылка
		|			И (ПлатежноеПоручение.Проведен = ИСТИНА)
		|			И (ПлатежноеПоручение.ВидОперации = &ПеречислениеПрочихВыплат)
		|ГДЕ
		|	ПеречислениеПрочихВыплат.Ссылка В(&МассивОбъектов)
		|	И ЕСТЬNULL(ПлатежноеПоручение.ВидОперации, &ПеречислениеПрочихВыплат) = &ПеречислениеПрочихВыплат
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежноеПоручениеПрочие.Ссылка,
		|	ПеречислениеПрочихВыплат.Ссылка,
		|	ПеречислениеПрочихВыплат.Организация,
		|	ПеречислениеПрочихВыплат.Дата,
		|	ПеречислениеПрочихВыплат.ГлавныйБухгалтер,
		|	ПеречислениеПрочихВыплат.Контрагент,
		|	ПеречислениеПрочихВыплат.ВидПрочихВыплат
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВедомостьПеречислениеПрочихВыплат.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ПлатежноеПоручение.ВидОперации, &ПеречислениеПрочихВыплат) КАК ВидОперации,
		|	ВедомостьПеречислениеПрочихВыплат.Организация КАК Организация,
		|	ВЫРАЗИТЬ(ВедомостьПеречислениеПрочихВыплат.Организация.НаименованиеПолное КАК СТРОКА(1000)) КАК НазваниеОрганизации,
		|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчет.НомерСчета, """") КАК ИИКОрганизации,
		|	ВедомостьПеречислениеПрочихВыплат.Организация.ИНН КАК БИНОрганизации,
		|	ЕСТЬNULL(БанкСчетаОрганизации.Код, """") КАК БИКОрганизации,
		|	ЕСТЬNULL(БанкСчетаОрганизации.Наименование, """") КАК БанкОрганизации,
		|	ЕСТЬNULL(БанкСчетаОрганизации.Город, """") КАК АдресБанкаОрганизации,
		|	ВедомостьПеречислениеПрочихВыплат.Организация.КБЕ КАК КБеОрганизации,
		|	ЕСТЬNULL(ПлатежноеПоручение.Номер, """") КАК НомерДокумента,
		|	ЕСТЬNULL(ПлатежноеПоручение.Дата, """") КАК ДатаДокумента,
		|	ЕСТЬNULL(ПлатежноеПоручение.Дата, ВедомостьПеречислениеПрочихВыплат.Дата) КАК ДатаСведений,
		|	ВедомостьПеречислениеПрочихВыплат.Контрагент КАК ГЦВП,
		|	ВЫРАЗИТЬ(ВедомостьПеречислениеПрочихВыплат.Контрагент.НаименованиеПолное КАК СТРОКА(1000)) КАК НазваниеГЦВП,
		|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчетКонтрагента.НомерСчета, """") КАК ИИКГЦВП,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Код, """") КАК БИКГЦВП,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Наименование, """") КАК БанкГЦВП,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Город, """") КАК АдресБанкаГЦВП,
		|	ВедомостьПеречислениеПрочихВыплат.Контрагент.ИНН КАК БИНГЦВП,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ПлатежноеПоручение.Контрагент.НаименованиеПолное, """") КАК СТРОКА(1000)) КАК НазваниеФонда,
		|	ЕСТЬNULL(ПлатежноеПоручение.БанковскийСчетКонтрагента.НомерСчета, """") КАК ИИКФонда,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Код, """") КАК БИКФонда,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Наименование, """") КАК БанкФонда,
		|	ЕСТЬNULL(БанкСчетаКонтрагента.Город, """") КАК АдресБанкаФонда,
		|	ЕСТЬNULL(ПлатежноеПоручение.Контрагент.ИНН, ВедомостьПеречислениеПрочихВыплат.Контрагент.ИНН) КАК БИНФонда,
		|	ЕСТЬNULL(ПлатежноеПоручение.Контрагент, """") КАК Фонд,
		|	ВедомостьПеречислениеПрочихВыплат.ВидПрочихВыплат КАК ВидПрочихВыплат,
		|	ВедомостьПеречислениеПрочихВыплат.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ВедомостьПеречислениеПрочихВыплат.ПериодПлатежа КАК ПериодПлатежа
		|ИЗ
		|	ВТ_ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьПеречислениеПрочихВыплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО (ВедомостьПеречислениеПрочихВыплат.ПлатежноеПоручениеСсылка = ПлатежноеПоручение.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК БанкСчетаОрганизации
		|		ПО (ПлатежноеПоручение.БанковскийСчет.Банк = БанкСчетаОрганизации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК БанкСчетаКонтрагента
		|		ПО (ПлатежноеПоручение.БанковскийСчетКонтрагента.Банк = БанкСчетаКонтрагента.Ссылка)
		|ГДЕ
		|	ВедомостьПеречислениеПрочихВыплат.Ссылка В(&МассивОбъектов)
		|	И ЕСТЬNULL(ПлатежноеПоручение.ВидОперации, &ПеречислениеПрочихВыплат) В (&МассивВидовОпераций)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидОперации,
		|	Ссылка";
		
		Запрос.Текст = ТекстЗапроса;
		
	ИначеЕсли Режим = "ПоТабличнойЧасти" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ВедомостьНаПеречислениеПрочихВыплат.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодРегистрации,
		|	ЕСТЬNULL(ВедомостьНаПеречислениеПрочихВыплат.Дата, """") КАК ДатаДокумента,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизЛицо,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
		|		ПО ВедомостьНаПеречислениеПрочихВыплат.Ссылка = ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
		|		ПО (ПлатежноеПоручениеВедомостиПрочие.Ведомость = ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручение.Ссылка = ПлатежноеПоручениеВедомостиПрочие.Ссылка
		|			И (ПлатежноеПоручение.Проведен = ИСТИНА)
		|ГДЕ
		|	 ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка В (&МассивОбъектов)
		|	 И ЕСТЬNULL(ПлатежноеПоручение.ВидОперации, &ПеречислениеПрочихВыплат) = &ПеречислениеПрочихВыплат
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокументовПоПериодам.Ссылка КАК Ссылка,
		|	ДанныеДокументовПоПериодам.ФизЛицо КАК ФизЛицо,
		|	ФИОФизЛиц.Фамилия КАК Фамилия,
		|	ФИОФизЛиц.Имя КАК Имя,
		|	ФИОФизЛиц.Отчество КАК Отчество
		|ПОМЕСТИТЬ ВТ_ФИОФизЛиц
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц КАК ФИОФизЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ФИОФизЛиц.Период) КАК Период,
		|			ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка КАК Ссылка,
		|			ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо КАК ФизЛицо
		|		ИЗ
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизЛиц
		|				ПО ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо = ФИОФизЛиц.ФизическоеЛицо
		|					И ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ДатаДокумента >= ФИОФизЛиц.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка,
		|			ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо) КАК ДанныеДокументовПоПериодам
		|		ПО ФИОФизЛиц.ФизическоеЛицо = ДанныеДокументовПоПериодам.ФизЛицо
		|			И ФИОФизЛиц.Период = ДанныеДокументовПоПериодам.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВедомостьПеречислениеПрочихВыплат.Ссылка КАК Ссылка,
		|	ВедомостьПеречислениеПрочихВыплат.ФизЛицо КАК ФизЛицо,
		|	ВедомостьПеречислениеПрочихВыплат.ФизЛицо.ИНН КАК ИИН,
		|	ВедомостьПеречислениеПрочихВыплат.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	ВЫБОР
		|		КОГДА ВедомостьПеречислениеПрочихВыплат.Сумма ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВедомостьПеречислениеПрочихВыплат.Сумма
		|	КОНЕЦ КАК Сумма,
		|	0 КАК СуммаПлатежа,
		|	ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество КАК ФИО,
		|	ВедомостьПеречислениеПрочихВыплат.ПериодРегистрации КАК ПериодРегистрации
        |
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо КАК ФизЛицо,
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодРегистрации КАК ПериодРегистрации,
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка КАК Ссылка,
		|		СУММА(ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Сумма) КАК Сумма
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодРегистрации КАК ПериодРегистрации,
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо КАК ФизЛицо,
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Сумма КАК Сумма,
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка КАК Ссылка
		|		ИЗ
		|			ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты КАК ВТ_ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты) КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизЛицо,
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодРегистрации,
		|		ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка) КАК ВедомостьПеречислениеПрочихВыплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИОФизЛиц КАК ФИОФизЛиц
		|		ПО (ФИОФизЛиц.Ссылка = ВедомостьПеречислениеПрочихВыплат.Ссылка)
		|			И (ФИОФизЛиц.ФизЛицо = ВедомостьПеречислениеПрочихВыплат.ФизЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ФИО,
		|	ПериодРегистрации
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Ссылка";
			
		Запрос.Текст = ТекстЗапроса;
			
	КонецЕсли;
	
	Если НЕ ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
        
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ВидОперации", ".ХозяйственнаяОперация");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПлатежноеПоручение.ВедомостиПрочие", "Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПлатежноеПоручение", "Документ.СписаниеБезналичныхДенежныхСредств");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти   

#КонецЕсли
